app/controllers/account_profile_controller.rb

SELECT * FROM `account_profiles` WHERE (`account_profiles`.`id` = 2)
---
  def myprofile
    @profile = AccountProfile.find(params[:id])