app/controllers/facility_controller.rb

INSERT INTO `facilities` (`name`, `address1`, `city`, `address2`, `zipcode`, `state`) VALUES('bulldog t1', 'asdf', 'bangalore', 'asdf', '560095', 'karnataka')
---
  def create
    if params['commit']  == 'Cancel'
	   redirect_to :action => ''
	   return
    else
    end


    @facility= Facility.create(params[:facility])