app/controllers/players_playoffs_controller.rb

  def playoff_tournament_schedule
    tp_id, td_league_schedule_id = params[:schedule].split(":")
    @tp = TournamentPlayer.find(tp_id)
---
SELECT * FROM `tournament_players` WHERE (`tournament_players`.`id` = 83)

  def tournament_league_standings
    @tournament = Tournament.find(params[:id])
    @players = TournamentPlayer.tournament_players_league_standings(params[:id])
    @selected = 0

    if request.get?
      @selected_percent, @selected = (@tournament.knockout_cutoff_percentage.blank?)? ["",0] : [@tournament.knockout_cutoff_percentage, @tournament.knockout_count.to_i]
    elsif request.xml_http_request?
      @selected = ((params[:percentage].to_f/100.to_f)*@players.length.to_f).ceil
      @tournament.update_attributes(:knockout_cutoff_percentage => params[:percentage], :knockout_count => @selected)
---
SELECT * FROM `tournaments` WHERE (`tournaments`.`id` = 1)
UPDATE `tournaments` SET `knockout_cutoff_percentage` = 30, `knockout_count` = 17 WHERE `id` = 1

  def my_league_standings
    @tournaments = Tournament.find(:all)
---
SELECT * FROM `tournaments` WHERE (`tournaments`.`id` = 1)

  def change_my_availability
    tp = TournamentPlayer.find(params[:id])
    available_tp = TournamentPlayer.available_knockout_non_selected_player(tp.tournament_id, tp.points)
    tp.update_attributes(:knockout => '0')
---
SELECT * FROM `tournament_players` WHERE (`tournament_players`.`id` = 0)
UPDATE `tournament_players` SET `knockout` = '0' WHERE `id` = 92

  def selected_knockout_players
    @tournament = Tournament.find(params[:id])
    if @tournament.knockout_selected.blank?
      @tournament.update_attributes(:knockout_selected => '1')
      @players = TournamentPlayer.tournament_players_league_standings(params[:id])
      selected = @tournament.knockout_count.to_i
      i = 1
      for player in @players
        if i <= selected
          TournamentPlayer.find(player.id).update_attributes(:knockout => '1')
---
SELECT * FROM `tournaments` WHERE (`tournaments`.`id` = 1)
UPDATE `tournaments` SET `knockout_selected` = '1' WHERE `id` = 1
SELECT * FROM `tournament_players` WHERE (`tournament_players`.`id` = 83)
UPDATE `tournament_players` SET `knockout` = '1' WHERE `id` = 83

  def division_playoff_scores
    player = TournamentPlayer.find(params[:player])
    opponent = TournamentPlayer.find(params[:opponent])
    league_schedule_game = LeagueScheduleGame.find(params[:lsg])
---
SELECT * FROM `tournament_players` WHERE (`tournament_players`.`id` = 83)
SELECT * FROM `league_schedule_games` WHERE (`league_schedule_games`.`id` = 29)

  def playoff_scores
    player = TournamentPlayer.find(params[:player])
    opponent = (params[:opponent].to_s == "0")? nil : TournamentPlayer.find(params[:opponent])
    league_schedule_game = LeagueScheduleGame.find(params[:lsg])
    td_league_schedule = league_schedule_game.tournament_division_league_schedule
    @tournament_division = td_league_schedule.tournament_division
    @tournament = @tournament_division.tournament
    @category = @tournament_division.tournament_category
    @level = @tournament_division.player_level

    if !opponent.blank?
      case params[:score][:sets]
        when "won"  then
          opponent_points = lookup(params[:p2g1].to_i + params[:p2g2].to_i)
          league_schedule_game.update_attributes(:winner => player, :loser => opponent, :winner_set_1 => params[:p1g1], :winner_set_2 => params[:p1g2], :loser_set_1 => params[:p2g1], :loser_set_2 => params[:p2g2], :winner_score => 10, :loser_score => opponent_points)
          pl_points = ((player.points.blank?)? 0 : player.points.to_i) + 10
          op_points = ((opponent.points.blank?)? 0 : opponent.points.to_i) + opponent_points
          player.update_attributes(:points => pl_points)
---
SELECT * FROM `tournament_players` WHERE (`tournament_players`.`id` = 83)
SELECT * FROM `league_schedule_games` WHERE (`league_schedule_games`.`id` = 29)
UPDATE `league_schedule_games` SET `winner` = 83, `loser` = 92, `winner_set_1` = 5, `winner_set_2` = 4, `winner_set_3` = 6, `loser_set_1` = 4, `loser_set_2` = 5, `loser_set_3` = 3, `winner_score` = 8, `loser_score` = 6 WHERE `id` = 29
UPDATE `tournament_players` SET `points` = 8 WHERE `id` = 83

  def create_knockout_draw
    @tournament = Tournament.find(params[:id])
    @tournament.update_attributes(:knockout_created => '1')
---
SELECT * FROM `tournaments` WHERE (`tournaments`.`id` = 1)
UPDATE `tournaments` SET `knockout_created` = '1' WHERE `id` = 1

      j = 1
      no_of_games_in_this_level.times do
        round = @rounds[i+1]
        ko_game = KnockoutGame.create(:tournament_id => @tournament.id, :round => i+1, :knockout_round_id => round.id)
        @pob.games.push("#{level_name}#{ko_game.id}")
---
INSERT INTO `knockout_games` (`tournament_id`, `winner`, `loser`, `winner_set_1`, `winner_set_2`, `winner_set_3`, `loser_set_1`, `loser_set_2`, `loser_set_3`, `winner_score`, `loser_score`, `start_date`, `end_date`, `parent_game_id`, `round`) VALUES(1, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 1)
UPDATE `knockout_games` SET `parent_game_id` = 32 WHERE `id` = 33

    @pob.root.each{|game|
      if game.content == "game"
        ko_game_id = game.name.split(":")[1]
        ko_game = KnockoutGame.find(ko_game_id)
---
SELECT * FROM `knockout_games` WHERE (`knockout_games`.`id` = 32)

        g_pls = all_pls.pop
        player1 = @ko_players[g_pls["player1"].to_s][0]
        player2 = @ko_players[g_pls["player2"].to_s][0]
        KnockoutGamePlayer.create(:knockout_game_id => l_game.id, :tournament_player_id => player1)
---
INSERT INTO `knockout_game_players` (`knockout_game_id`, `tournament_player_id`) VALUES(47, 83)

  def view_knockout_draw
    @tournament = Tournament.find(params[:id])
---
SELECT * FROM `tournaments` WHERE (`tournaments`.`id` = 1)