app/controllers/player_level_controller.rb

  def create
	if params['commit']  == 'Cancel'
	   redirect_to :action => ''
	   return
    else
	end


	@level= PlayerLevel.create(params[:level])
---
INSERT INTO `player_levels` (`name`) VALUES('L1')