app/controllers/tournament_players_controller.rb

SELECT * FROM `tournaments` WHERE (`tournaments`.`id` = 2)
---
 def tour_player_registration
    @id = session[:user_id]
    id = params[:id]
    @tournament = Tournament.find(id)