app/controllers/tournaments_controller.rb

  def create
    if params['commit']  == 'Cancel'
	    redirect_to :action => 'new'
	    return
    end

    reg_starts =  Time.parse(params[:tournament][:registration_starts])
    reg_ends = Time.parse(params[:tournament][:registration_ends])
    tourn_starts = Time.parse(params[:tournament][:tournament_starts])
    tourn_ends =  Time.parse(params[:tournament][:tournament_ends])
 	  @tournament = Tournament.create(:name => params[:tournament][:name], :city => params[:tournament][:city], :tournament_type => 	params[:tournament][:tournament_type], :kind_of_tournament => params[:tournament][:kind_of_tournament], :registration_starts => reg_starts,	:registration_ends => reg_ends, :tournament_starts => tourn_starts, :tournament_ends => tourn_ends)
---
INSERT INTO `tournaments` (`name`, `city`, `registration_starts`, `kind_of_tournament`, `category_id`, `tournament_starts`, `registration_ends`, `tournament_type`) VALUES('T1', 'bangalore', 1270060200, 'O', 1, 1271010600, 1272565800, 'K')

  def edit_tournament
  	@tournament = Tournament.find(params[:id])
---
SELECT * FROM `tournaments` WHERE (`tournaments`.`id` = 1)

  def update
    @tournament = Tournament.find(params[:id])
    reg_starts =  Time.parse(params[:tournament][:registration_starts])
    reg_ends = Time.parse(params[:tournament][:registration_ends])
    tourn_starts = Time.parse(params[:tournament][:tournament_starts])

    if @tournament.update_attributes(:name => params[:tournament][:name], :city => params[:tournament][:city], :tournament_type => 	params[:tournament][:tournament_type], :kind_of_tournament => params[:tournament][:kind_of_tournament], :registration_starts =>   		reg_starts,	:registration_ends => reg_ends, :tournament_starts => tourn_starts)
---
SELECT * FROM `tournaments` WHERE (`tournaments`.`id` = 1)
UPDATE `tournaments` SET `registration_ends` = 1272565800, `tournament_starts` = 1271010600, `registration_starts` = 1270060200 WHERE `id` = 1

  def delete
  	Tournament.delete(params[:id])
---
DELETE FROM `tournaments` WHERE (`id` IN ('1'))

  def league_division
    per_page = (params[:per_page].blank?)? 10 : params[:per_page]

    @tournament = Tournament.find(params[:id])
---
SELECT * FROM `tournaments` WHERE (`tournaments`.`id` = 1)

  def players_to_divisions
    @tournament = Tournament.find(params[:id])
    @category = TournamentCategory.find(params[:category])
    @level = PlayerLevel.find(params[:level])
---
SELECT * FROM `tournaments` WHERE (`tournaments`.`id` = 1)
SELECT * FROM `tournament_categories` WHERE (`tournament_categories`.`id` = 3)
SELECT * FROM `player_levels` WHERE (`player_levels`.`id` = 1)

  def category_level_draw_schedules
    @category = TournamentCategory.find(params[:cid])
    @level = PlayerLevel.find(params[:lid])
    @tournament = Tournament.find(params[:id])
---
SELECT * FROM `tournament_categories` WHERE (`tournament_categories`.`id` = 5)
SELECT * FROM `player_levels` WHERE (`player_levels`.`id` = 1)
SELECT * FROM `tournaments` WHERE (`tournaments`.`id` = 1)

  def update_player_with_division
    player = params[:player]
    div, division = params[:division].split("_")
    @tp = TournamentPlayer.find(player)
    if division.blank?
      @tp.update_attributes(:tournament_division_id => nil)
    else
      @tp.update_attributes(:tournament_division_id => division)
    end
    @draw = Tournament.create_draw?(@tp.tournament_id, @tp.player_level_id, @tp.tournament_category_id)

    @category = TournamentCategory.find(@tp.tournament_category_id)
---
SELECT * FROM `tournament_players` WHERE (`tournament_players`.`id` = 140)
UPDATE `tournament_players` SET `tournament_division_id` = 9 WHERE `id` = 74
SELECT * FROM `player_levels` WHERE (`player_levels`.`id` = 1)
SELECT * FROM `tournament_categories` WHERE (`tournament_categories`.`id` = 2)
SELECT * FROM `tournaments` WHERE (`tournaments`.`id` = 1)

  def add_points
    @tournament = Tournament.find(params[:id])
    @players = Tournament.list_of_tournament_players(params[:id])

    @tournament.update_attributes(:knockout_cutoff_percentage => 100, :knockout_count => @players.length, :knockout_selected => '1')
---
SELECT * FROM `tournaments` WHERE (`tournaments`.`id` = 3)
SELECT * FROM `tournament_players` WHERE (`tournament_players`.`id` = 95)
UPDATE `tournament_players` SET `points` = 1, `knockout` = '1' WHERE `id` = 98
UPDATE `tournaments` SET `knockout_cutoff_percentage` = 100, `knockout_count` = 54, `knockout_selected` = '1' WHERE `id` = 3