app/controllers/users_controller.rb

INSERT INTO `users` (`name`, `salt`, `crypted_password`, `time_created`, `remember_token_expires_at`, `account_type`, `deleted`, `remember_token`, `login`, `email`) VALUES(NULL, 'c61fe7e5566f988730b11ff5c4b4201c2b9651fb', '5d7981dd38723e52e2a0ef86391f36d9592e708c', 1272365987, NULL, 'player', 'No', NULL, 'relton', 'relton@hibiscustech.com')
SELECT `users`.id FROM `users` WHERE (`users`.`email` = BINARY 'relton@hibiscustech.com' AND `users`.id <> 2) LIMIT 1
---
  def create
    logout_keeping_session!

    @user = User.new(:login => params[:user][:email], :email => params[:user][:email], :password => params[:user][:password], :password_confirmation => params[:user][:password_confirmation])
    @user.account_type = params[:user][:account_type]
    @user.time_created = Time.now.to_i

    success = @user && @user.save

     @id = @user.id
    if success && @user.errors.empty? && @user.account_type == 'admin'

INSERT INTO `account_profiles` (`address1`, `city`, `address2`, `contact_number`, `zipcode`, `gender`, `first_name`, `user_id`, `last_name`, `state`, `email_address`) VALUES('', '', '', '', '', 'm', 'suresh', 1, '', '', '')
---
  def create_profile
    if params['commit']  == 'Cancel'
	    redirect_to :action => 'new'
	    return
    end

    @profile = AccountProfile.create(params[:profile])

SELECT * FROM `player_levels` WHERE (name='L1')
INSERT INTO `player_levels` (`name`) VALUES('L2')
INSERT INTO `account_playing_details` (`level_id`, `facility_id`, `user_id`, `verified`) VALUES(1, 1, 1, 'No')
---
  def create_playing_details
  	if params['commit']  == 'Cancel'
	   redirect_to :action => 'new'
	   return
    else
    end

    other_level = params[:account][:other_level]
    level = params[:account][:level_id]

    if level == 'other'
      @check = PlayerLevel.find(:all, :conditions => ["name=?", other_level])

      if !@dest.nil?
        flash[:notice] = "Player level already exists"
        redirect_to :action => "acc_playing_details", :id => params[:playing_details][:user_id]
      else
	      @level = PlayerLevel.create(:name => other_level)
	      new_level = @level.id

	      @playing_details = AccountPlayingDetail.create(:player_level_id => new_level, :facility_id => params[:account][:facility_id], :user_id  => 	   	      params[:playing_details][:user_id])